# Тапшырма 1: Температурага жараша кийим тандоо
# Тапшырма 2: 1ден 10го чейинки сандарды принт кыл
# Tапшырма 3: Тек гана жуп сандарды чыгар
# Тапшырма 4: Биринчи 5ти бөлгөн санды тап (,бештин болуучусу)
# Тапшырма 5: 1ден 10го чейин, бирок 4тү өткөрүп кет(игнор кылып кет)
# Тапшырма 7: Тескери эсептөө ( 10 дон 1ге чейин)
# Тапшырма 9: 1ден баштап 100гө чейин, бирок биринчи 7ге бөлүнгөн сан чыкканда токтот
# Тапшырма 6: Жуп же так экенин текшер ( колдонуучу берген сан)
# Тапшырма 7: Колдонуучудан диапазон алып, сандарды чыгарып берүү ( for loop menen jana range() methodun koldonuu)


# Тапшырма 1: Температурага жараша кийим тандоо


# a = int(input("Температураны киргизиңиз:"))
# if a < 0:
#     print("Кышкы кийимдерди кийиңиз")
# elif 0 <= a < 20:
#     print("Жайкы кийимдерди кийиңиз")
# elif 20 <= a < 30:
#     print("Күзгү кийимдерди кийиңиз")
# elif a >= 30:
#     print("Жазгы кийимдерди кийиңиз")


# Тапшырма 2: 1ден 10го чейинки сандарды принт кыл

# b = 10
# if b > 0:
#     for i in range(1, b + 1):
#         print(i)
# else:
#     print("Сан терс")


# Tапшырма 3: Тек гана жуп сандарды чыгар


# san = int(input("Санды киргизиңиз: "))
# if san % 2 == 0:
#   print ("Жуп сан")
# else:
#   print ("Так сан")


# Тапшырма 4: Биринчи 5ти бөлгөн санды тап (,бештин болуучусу)


# a = int(input("Санды киргизиңиз: "))
# for i in range(1, 11):
#     if i % 5 == 0:
#         print(f"{i} 5ке бөлүнөт")
#     else:
#         print(f"{i} 5ке бөлүнбөйт")


# Тапшырма 5: 1ден 10го чейин, бирок 4тү өткөрүп кет(игнор кылып кет)

# for i in range(1, 11):
#     if i == 4:
#         continue
#     print(i)


# Тапшырма 7: Тескери эсептөө ( 10 дон 1ге чейин)

# a = 10
# for i in range(a, 0, -1):
#     print(i)


# Тапшырма 9: 1ден баштап 100гө чейин, бирок биринчи 7ге бөлүнгөн сан чыкканда токтот

# a = 100
# for i in range(1, a + 1):
#     if i % 7 == 0:
#         print(f'7ге бөлүнгөн сан: {i}')
#         break


# Тапшырма 6: Жуп же так экенин текшер ( колдонуучу берген сан)


# a = int(input("Санды киргизиңиз: "))
# if a % 2 == 0:
#     print(f"{a} жуп сан")
# else:
#     print(f"{a} так сан")


# Тапшырма 7: Колдонуучудан диапазон алып, сандарды чыгарып берүү ( for loop menen jana range() methodun koldonuu)

# a = int(input("Башталгыч санды киргизиңиз: "))
# b = int(input("Аяккы санды киргизиңиз: "))
# for i in range(a, b + 1):
#     print(i)
      